{
  "type": "text",
  "text": "Xi Knows The 'Consequences': Trump's Cryptic Warning On Taiwan InvasionTrump said Taiwan \"never even came up as a subject\" when he met the Chinese president in South Korea on Thursday.\nAgence France-Presse\nWorld News\nNov 02, 2025 22:28 pm IST\nPublished On\nNov 02, 2025 22:28 pm IST\nLast Updated On\nNov 02, 2025 22:28 pm IST\nRead Time:\n2 mins\nShare\nTwitterWhatsAppFacebookRedditEmail\nXi Knows The 'Consequences': Trump's Cryptic Warning On Taiwan Invasion\nChina claims self-governing Taiwan as its territory.United States:\nPresident Donald Trump said Xi Jinping understands the consequences if China invades Taiwan, while refusing to specifically say the United States would defend the island, according to an extract of a CBS News interview broadcast Sunday.\n\nTrump said Taiwan \"never even came up as a subject\" when he met the Chinese president in South Korea on Thursday for their first face-to-face meeting in six years.\n\nAsked on CBS's \"60 Minutes\" whether he would order US forces into action if China moved militarily on Taiwan, Trump said: \"You'll find out if it happens, and he understands the answer to that.\"\n\nBut Trump declined to spell out what he meant in the interview conducted Friday at his Mar-a-Lago resort in Florida, adding: \"I can't give away my secrets. The other side knows.\"\n\nThe US president claimed that Xi and those close to him had \"openly said\" that \"'we would never do anything while President Trump is president,' because they know the consequences.\"\n\nChina claims self-governing Taiwan as its territory. Under longstanding policy, the United States recognises only Beijing but provides weapons for the island's self-defence.\n\nThe issue continues to provoke tensions, which Trump and Xi appeared to have avoided at their summit, focusing instead on easing the trade war between Washington and Beijing.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "timestamp": "2025-11-03T07:13:32.442118"
}