{
  "topic": "Bucklebury Farm, a Berkshire farm park co-owned by Pippa Middleton, sister of Catherine, the Princess of Wales, has reportedly become the first establishment in the country to cease allowing visitors ...",
  "text": "Farm stops picking up rabbits after charity plea\n3 days ago\n\nShare\n\nSave\nLinzi Kinghorn\nSouth of England\nBBC Rae Walters, who has shoulder length strawberry blonde hair, looking at the camera at the farm.BBC\nRae Walters praised Bucklebury Farm for its \"really creative and inventive\" methods\nA Berkshire farm park is reportedly the first in the country to act on an animal charity's calls to stop visitors picking up rabbits and guinea pigs.\n\nBucklebury Farm, co-owned by Catherine, the Princess of Wales' sister Pippa Middleton, has been \"really creative\", the Rabbit Welfare Association and Fund (RWAF) said.\n\nThe farm has adopted measures so animals are not picked up or placed on tables.\n\n\"If they choose to come up and interact with you, great – that's their choice. If they choose not to interact, they have to be allowed to do that,\" the RWAF's chief executive Rae Walters said.\n\nTwo guinea pigs eating a lettuce leaf on a string.\nThe charity praised the farm for innovations including \"guinea pig fishing\"\n\"It's the forced interactions [they don't like],\" she said.\n\n\"Rabbits are really intelligent, reactive, social animals and we absolutely adore them.\n\n\"They should be celebrated for all of their characteristics. It should not be just down to putting them on a table and scaring them and petting them.\"\n\nMore from Berkshire\nConcern over lack of training after death of baby\nWoman charged after footballer loses leg in crash\nDad 'super proud' of daughter, 10, for CPR rescue\nShe praised Bucklebury Farm for innovations such as \"guinea pig fishing\", where vegetables and treats are lowered into their pens for them to eat.\n\n\"The changes we've made at Bucklebury Farm are all about giving our rabbits the life they truly deserve,\" Oliver Shute, its managing director, said.\n\n\"They have space to run, dig and hide, which helps them feel safe and content.\n\n\"For us, it's not just about visitors seeing animals, it's about showing what proper welfare looks like.\n\n\"Rabbits are often misunderstood and kept in spaces that don't meet their needs, so we're proud to set an example that puts their wellbeing first.\"",
  "significance_score": 0.45
}