{
  "topic": "Cat News, the official newsletter of the IUCN/SSC Cat Specialist Group, first began publication in 1984 and continues to serve its subscribers by offering a diverse collection of scientific papers, ar...",
  "source_file": "leftist.json",
  "processed_at": "2025-11-03T22:04:28.754786",
  "total_items": 6,
  "items": [
    {
      "text": "The continued operation of 'Cat News' highlights a critical gap in public awareness about the real threats faced by wild cat populations.",
      "bias_x": 0.0,
      "significance_y": 0.81,
      "combined_score": 0.0,
      "color": "red",
      "relevant_links": [
        {
          "title": "Cat News | IUCN CatSG\nwww.catsg.org › catnews",
          "link": "https://www.catsg.org/catnews",
          "snippet": "",
          "trust_score": 0.9,
          "source_type": "Academic",
          "extracted_content": "IUCN/SSC Cat Specialist Group Cat News, the IUCN/SSC Cat Specialist Group's newsletter, was first published in 1984. Cat News continues to provide subscribers with a wide-ranging collection of scientific papers, articles, case studies and news items. It covers original contributions, observations and news related to the conservation of cat species across the world. Each issue of Cat News is at least 40 pages in length and features a cat species on its cover. Articles are submitted by Cat SG members, as well as other cat specialists from around the world. The editorial team gathers material from many sources, including journals, magazines and the internet, and solicits special contributions on topics of interest. Original Contributions and Short Communications are peer reviewed. In addition to the three regular annual issues, the series Cat News Special Issue, typically developed together with partner institutions, covers specific themes relevant to cat conservation or research. Cat News is available to members and Friends of the Cat Specialist and can be ordered at ch.breitenmoser(at)kora.ch. Guidelines for Authors can be found here. Cat News - Archive The abstracts and SOM of Cat News Issue 60 (Spring 2014) onwards will be available shortly. To order a previous issue of Cat News please write to ch.breitenmoser(at)kora.ch. Click on the icon to redirect to the page containing all the pdfs of the Cat News Special Issue Cat News P. Meier The Latest Cat News Issue is now out! Editorial List of Contents Abstracts Cats in the News Supporting Online Materials: Wangdi & Dhendup 2025. Felid diversity in Wangchuck Centennial National Park of Bhutan Wangdi & Dhendup 2025. Ten Asiatic golden cat colour morphs in Wangchuck Centennial National Park, Bhutan Voon M. et al. 2025. Sunda clouded leopard and other felids in a high-altitude forest of Sarawak, Borne Baral et al. 2025. Known western range of Asiatic golden cat extended to Jajarkot, Nepal Rosen et al. 2025. First observation of intraspecific aggression between two Persian leopards. Cat News 82 Editorial List of Contents Abstracts Cats in the News Supporting Online Materials: 1. Cats in the News Further SOM 2. Hunter et al. 2025. A puma, a tapir and a stalking horse 3. Chatellenaz M. et al. Records of short-tailed pumas in northeastern Argentina 4. Bahadur K.C. R. et al. Using camera traps to identify and help manage problematic tigers in Nepal 5. Carlton E. et al. Arabian Leopard recovery: Results of the first Green Status of Species assessment Cat News 81 Editorial List of Contents Abstracts Cats in the News Supporting Online Materials: 1. Cats in the News Further SOM 2. Johnson ex-situ management with a view to wild conservation Cat News 80 Editorial List of Contents Abstracts Cats in the News Small Cat Report April 2024 Supporting Online Materials: 1. Ahmed et al. SOM 2. Power et al. SOM 3. Singh et al. SOM 4. Sliwa et al. SOM Cat News 80 Cat News 76 Cat News 79 Cat News 75 Cat News 78 Cat News 74 Cat News 77 Cat News 73 Cat News 72 Cat News 68 Cat News 71 Cat News 67 Cat News 70 Cat News 66 Cat News 69 Cat News 65 Cat News 64 Cat News 60 Cat News 63 Cat News 62 Cat News 61 Contact Impressum Support the CatSG M. Pittet © 2024 by IUCN/SSC Cat Specialist Group"
        }
      ]
    },
    {
      "text": "It would be beneficial to know if 'Cat News' also includes practical guidance for conservationists working on the ground.",
      "bias_x": 0.1905,
      "significance_y": 0.74,
      "combined_score": 0.141,
      "color": "orange",
      "relevant_links": []
    },
    {
      "text": "Understanding the readership demographics of 'Cat News' could help tailor its content to be more effective in reaching a wider audience.",
      "bias_x": 0.3333,
      "significance_y": 0.73,
      "combined_score": 0.2433,
      "color": "yellow",
      "relevant_links": []
    },
    {
      "text": "The focus on 'scientific papers' might alienate readers who are interested in broader conservation efforts and success stories.",
      "bias_x": 0.2857,
      "significance_y": 0.68,
      "combined_score": 0.1943,
      "color": "orange",
      "relevant_links": []
    },
    {
      "text": "Scientific papers in 'Cat News' are often behind paywalls, making them inaccessible to the general public and independent researchers.",
      "bias_x": 0.0952,
      "significance_y": 0.65,
      "combined_score": 0.0619,
      "color": "red",
      "relevant_links": []
    },
    {
      "text": "The content of 'Cat News' likely represents a snapshot of current research, and it would be interesting to see how the topics have evolved over the decades.",
      "bias_x": 0.381,
      "significance_y": 0.65,
      "combined_score": 0.2477,
      "color": "yellow",
      "relevant_links": []
    }
  ]
}