{
  "topic": "Priyanka Gandhi calls on Modi, Delhi CM to 'clear filthy smog' in Delhi: ‘We will support and cooperate…’Story by HT News Desk • 3h • ",
  "text": "Congress leader Priyanka Gandhi on Sunday called on Prime Minister Narendra Modi and Delhi chief minister Rekha Gupta to take steps to “clear the filthy smog” in the Capital.In a post on social media platform X, Priyanka compared the air quality in Delhi to that in Wayanad. “Returning to the Delhi air from Wayanad first, then Bachwara in Bihar is truly shocking,” she said, adding that pollution had enveloped the Capital “like a grey shroud.”Priyanka also urged all political leaders to join hands “regardless of our political compulsions and do something about it.” The Wayanad MP said the Centre and state governments “need to act immediately” on the matter, while assuring that everyone would “support and cooperate with whatever actions they choose to take to mitigate this awful situation.”She highlighted that those with respiratory issues, children commuting to school daily and senior citizens need “urgent intervention.” “Year after year the citizens of Delhi are subjected to this toxicity with no recourse,” she added.‘Cruel joke’: Jairam Ramesh on cloud-seeding trialsMeanwhile, Congress general secretary in-charge (Communications) Jairam Ramesh criticised the winter cloud seeding experiment conducted by the BJP-led government in Delhi. while referring to it as a “cruel joke”.“The Delhi Govt has spent ₹34 crore on a winter cloud seeding experiment in order to improve air quality,” Ramesh said on X.He said that the Union Minister of State of Environment, Forests, and Climate Change in December last year had told the Rajya Sabha that three specialised agencies had “clearly advised against” winter cloud seeding to improve air quality in Delhi. These agencies were the Commission for Air Quality Management in NCT, the Central Pollution Control Board, and the Indian Meteorological Department, Ramesh said.He further highlighted a detailed report from the Centre for Atmospheric Sciences at IIT Delhi on the subject, which was released on Friday (October 31). Ramesh said the report “makes it clear that winter cloud seeding will not help improve the atrocious air quality in Delhi in any significant manner.”Ramesh said that the experiment looks “dramatic” and “gives the impression that something is demonstrably being done.” However, he flagged concerns regarding the “doubts and serious questions on its efficacy.”“…Is it wise to lay so much store by it except as a headline-grabbing measure? Getting 'slight improvement in a limited area for a day or two' as is now being claimed is really a cruel joke.,” Jairam said in the post.",
  "significance_score": 0.99
}