{
  "topic": "On September 19, 2025, Congress leader Rahul Gandhi initiated a new controversy by alleging widespread voter fraud in Maharashtra and Karnataka, claiming an automated software was used to manipulate e...",
  "text": "Rahul Gandhi’s allegations spark fresh vote theft debate in Maharashtra\nRahul Gandhi alleged voter fraud in Maharashtra and Karnataka, claiming automated software manipulated electoral rolls. BJP counters his claims.\nPublished on: Sep 19, 2025 7:05 AM IST\nBy\nFaisal Malik\nShare\n\nMUMBAI: Minutes after Congress leader Rahul Gandhi levelled allegations of unauthorised voter additions in the Rajura assembly constituency in Maharashtra and deletions in Aland constituency in Karnataka, Subhash Dhote, Rajura’s Congress candidate, said he had lost the polls because of this electoral rigging.\n\nRahul Gandhi’s allegations spark fresh vote theft debate in Maha\nRahul Gandhi’s allegations spark fresh vote theft debate in Maha\nGandhi on Thursday charged that the rigging was done through an automated software. The same software, he added, had been used to add and delete voters in Maharashtra, Karnataka, Haryana and Uttar Pradesh, and was now being used in Bihar.\n\nRajura is one of the six assembly seats in the Chandrapur Lok Sabha constituency. Congress candidate Pratibha Dhanorkar won the Chandrapur seat by 2,60,000 votes, and in the Rajura assembly segment alone, the Congress’ lead was 58,349 votes. However, in the assembly polls just six months later, the BJP’s Deorao Bhongle defeated Dhote by 3,054 votes.\n\nDhote said he would have won the elections by over 3,000 votes for the third time. “When I lodged a formal complaint with the Election Commission (EC) about the fraudulent entries, they deleted all of them,” he said. “The tehsildar also filed an FIR in the case. However, the EC is not sharing the details of those involved in the scam with the police.” Dhote has written letters to the district collector and the Superintendent of Police about this but to no avail.\n\nBhongle claimed it was he who filed a complaint with the EC when the revision of the electoral rolls was taking place before the polls. “I suspected bogus names were being added, based on which many applications were rejected during the process,” he said. “The names were not added in the list as has been claimed by Rahul ji.” Bhongle added that there were 344 booths in the constituency and the addition of 10,600 new voters was normal.\n\nCongress spokesperson Atul Londhe claimed that around 55,000 new voters were added to the Chandrapur Lok Sabha seat within five months. “Between October 1 and 15, 2024, as many as 11,667 bogus voters were registered online,” he said. “After our complaint, the entries were deleted but our demand for the IP addresses, email IDs, and mobile numbers used for fake registrations remains unfulfilled.”\n\nShiv Sena (UBT) MP Arvind Sawant said that by refusing to share CCTV footage of voting centres, the EC had proved that whatever Gandhi was saying was true. “If it has any self-respect, it should answer Rahul Gandhi’s questions,” he said.\n\nThe BJP trained its guns on Gandhi, with CM Devendra Fadnavis terming him “a serial liar” and offering as “proof” the EC’s rejection of Gandhi’s expose. “Since the defeat in Maharashtra has deeply hurt them, he is making all these allegations,” he said. “The EC has issued him notices, but he has not provided any evidence either to the commission or to the court. This is an insult to India’s Constitution and judiciary.”\n\nState NCP president Sunil Tatkare termed the charges “childish” and proclaimed that voters were knowledgeable enough to understand the “narrative” being set by the Congress leader and the INDIA bloc.",
  "significance_score": 0.45
}